ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_lls.c
/******************************************************************************
* Function Name: Cy_BLE_LLSS_ConnectEventHandler
***************************************************************************//**
*
*  Handles the Connection Indication event for Link Loss Service.
*
******************************************************************************/
static void Cy_BLE_LLSS_ConnectEventHandler(void)
{
    uint8_t tmpAlertLevel = CY_BLE_NO_ALERT;

    /* Input parameters validation passed, so save Alert Level */
    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
    {
        .handleValuePair.attrHandle = cy_ble_llsConfigPtr->llss->alertLevelCharHandle,
        .handleValuePair.value.len  = CY_BLE_LLS_ALERT_LEVEL_SIZE,
        .offset                     = 0u,
        .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
    };

    dbAttrValInfo.handleValuePair.value.val = &tmpAlertLevel;
    (void)Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);
}


/******************************************************************************
* Function Name: Cy_BLE_LLSS_WriteEventHandler
***************************************************************************//**
*
*  Handles the Write Request Event for the Link Loss service.
*
*  \param cy_stc_ble_gatts_write_cmd_req_param_t * eventParam:  the pointer to the data structure
*                                               specified by the event.
*
* \return
*  cy_en_ble_gatt_err_code_t: Function result returns one of the following status values:
*   * CY_BLE_GATT_ERR_NONE - The Alert Level Characteristic was written successfully
*   * CY_BLE_GATT_ERR_UNLIKELY_ERROR - An Internal Stack error occurred
*   * CY_BLE_GATT_ERR_INVALID_ATTRIBUTE_LEN - The Data length for the Alert Level
*                                             Characteristic handle is invalid
*   * CY_BLE_GATT_ERR_INVALID_HANDLE - Alert Level Characteristic handle is invalid
*   * CY_BLE_GATT_ERR_OUT_OF_RANGE - Value is out of allowed range
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_LLSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;

    if(Cy_BLE_LLS_ApplCallback != NULL)
    {
        if(cy_ble_llsConfigPtr->llss->alertLevelCharHandle == eventParam->handleValPair.attrHandle)
        {
            /* Check if attribute handle is handle of Alert Level characteristic of
             * Link Loss service. */
            if((CY_BLE_HIGH_ALERT >= eventParam->handleValPair.value.val[0u]))
            {
                if(eventParam->handleValPair.value.len == CY_BLE_LLS_ALERT_LEVEL_SIZE)
                {
                    /* Input parameters validation passed, so save Alert Level */
                    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                    {
                        .handleValuePair = eventParam->handleValPair,
                        .connHandle      = eventParam->connHandle,
                        .offset          = 0u,
                        .flags           = CY_BLE_GATT_DB_PEER_INITIATED,
                    };
                    gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);

                    /* Send callback to user if no error occurred while writing Alert Level */
                    if(gattErr == CY_BLE_GATT_ERR_NONE)
                    {
                        cy_stc_ble_lls_char_value_t wrReqParam =
                        {
                            .connHandle = eventParam->connHandle,
                            .charIndex  = CY_BLE_LLS_ALERT_LEVEL,
                            .value      = &eventParam->handleValPair.value
                        };
                        Cy_BLE_LLS_ApplCallback((uint32_t)CY_BLE_EVT_LLSS_WRITE_CHAR_REQ, (void*)&wrReqParam);
                    }
                }
                else
                {
                    gattErr = CY_BLE_GATT_ERR_INVALID_ATTRIBUTE_LEN;
                }
            }
            else
            {
                gattErr = CY_BLE_GATT_ERR_OUT_OF_RANGE;
            }

            /* Indicate that request was handled */
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }

    return(gattErr);
}


/******************************************************************************
* Function Name: Cy_BLE_LLSS_GetCharacteristicValue
***************************************************************************//**
*
*  Gets an Alert Level characteristic value of the service, which is identified
*  by charIndex.
*
*  \param charIndex: The index of an Alert Level characteristic.
*  \param attrSize: The size of the Alert Level characteristic value attribute.
*  \param attrValue: The pointer to the location where an Alert Level characteristic
*               value data should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The characteristic value was read successfully
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_LLSS_GetCharacteristicValue(cy_en_ble_lls_char_index_t charIndex,
                                                          uint8_t attrSize,
                                                          uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if((attrValue != NULL) && (charIndex == CY_BLE_LLS_ALERT_LEVEL) && (attrSize == CY_BLE_LLS_ALERT_LEVEL_SIZE))
    {
        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
        {
            .handleValuePair.attrHandle = cy_ble_llsConfigPtr->llss->alertLevelCharHandle,
            .handleValuePair.value.len  = attrSize,
            .handleValuePair.value.val  = attrValue,
            .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
        };
        /* Get Alert Level characteristic value from GATT database */
        if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
        {
            /* Indicate success */
            apiResult = CY_BLE_SUCCESS;
        }
    }

    /* Return status */
    return(apiResult);
}

#endif /* (CY_BLE_LLS_SERVER) */


#ifdef CY_BLE_LLS_CLIENT

